---
type: UpdaterId
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# UpdaterId

`Autodesk.Revit.DB.UpdaterId` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | UpdaterId | 2011 | `public UpdaterId ( AddInId addInId , Guid val )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAddInId | 2011 | `public AddInId GetAddInId ()` |
| Method | GetGUID | 2011 | `public Guid GetGUID ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |